app/controllers/favorites_controller.rb

  def create
    @favorite = Favorite.create(
      skatepark_id: params[:skatepark_id],
      user_id: params[:id])

    @skatepark = Skatepark.find(params[:skatepark_id])
    @skatepark.increment!(:fav_count)
---
INSERT INTO "favorites" ("skatepark_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["skatepark_id", 1], ["user_id", 1], ["created_at", "2015-08-07 19:42:07.034421"], ["updated_at", "2015-08-07 19:42:07.034421"]]
SELECT  "skateparks".* FROM "skateparks" WHERE "skateparks"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "skateparks" SET "fav_count" = $1, "updated_at" = $2 WHERE "skateparks"."id" = $3  [["fav_count", 1], ["updated_at", "2015-08-07 18:07:30.502845"], ["id", 1]]

  def attend
  	@favorite = Favorite.where(
  		skatepark_id: params[:skatepark_id],
  		user_id: params[:id]).first

  	if @favorite
  		@favorite.update_attributes(attending: true)
  	else
  		Favorite.create(
  			skatepark_id: params[:skatepark_id],
  			user_id: params[:id],
  			attending: true)
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."skatepark_id" = $1 AND "favorites"."user_id" = $2  ORDER BY "favorites"."id" ASC LIMIT 1  [["skatepark_id", 1], ["user_id", 1]]
INSERT INTO "favorites" ("skatepark_id", "user_id", "attending", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["skatepark_id", 1], ["user_id", 1], ["attending", "t"], ["created_at", "2015-08-12 21:36:20.158936"], ["updated_at", "2015-08-12 21:36:20.158936"]]

  def unattend
  	@favorite = Favorite.where(
  		skatepark_id: params[:skatepark_id],
  		user_id: params[:id]).first

 		@favorite.update_attributes(attending: false) if @favorite
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."skatepark_id" = $1 AND "favorites"."user_id" = $2  ORDER BY "favorites"."id" ASC LIMIT 1  [["skatepark_id", 1], ["user_id", 1]]
UPDATE "favorites" SET "attending" = $1, "updated_at" = $2 WHERE "favorites"."id" = $3  [["attending", "f"], ["updated_at", "2015-08-12 21:38:45.182708"], ["id", 1]]