app/controllers/skateparks_controller.rb

SELECT "skateparks".* FROM "skateparks"
---
  def index
    @skateparks = Skatepark.all

SELECT  "skateparks".* FROM "skateparks" WHERE "skateparks"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @skatepark = Skatepark.find(params[:id])

SELECT COUNT(*) FROM "users" WHERE "users"."current_park" = $1  [["current_park", 1]]
---
  def attendee_count
  	render json: User.where(current_park: params[:id]).count