app/controllers/users_controller.rb

  def create
    @user = User.new(name: params[:name], email: params[:email])

    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Chris"], ["created_at", "2015-08-07 15:49:22.347062"], ["updated_at", "2015-08-07 15:49:22.347062"]]

  def favorites
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["uid", "1"]]

  def authenticate
    @user = User.where(uid: params[:google][:id]).first
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["uid", "google:100731061466734742350"]]

  def attend_park
    @user = User.find(params[:id])
    @skatepark = Skatepark.find(params[:skatepark_id])

    @user.update_attributes(current_park: @skatepark.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "skateparks".* FROM "skateparks" WHERE "skateparks"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "current_park" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_park", 1], ["updated_at", "2015-08-12 21:55:15.946113"], ["id", 1]]

  def leave_park
    @user = User.find(params[:id]).update_attributes(current_park: nil)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "current_park" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_park", nil], ["updated_at", "2015-08-12 21:55:44.398435"], ["id", 1]]